Revit 2015 API
Document.NewLineLoad Method
Creates a new line load within the project.
Overload List
Name | Description
NewLineLoad(Element, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
Creates a new hosted line load within the project using data at two points.
NewLineLoad(Reference, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
Creates a new hosted line load within the project using data at an array of points.
NewLineLoad(IList<XYZ>, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
Creates a new unhosted line load within the project using data at an array of points.
NewLineLoad(XYZ, XYZ, XYZ, XYZ, XYZ, XYZ, Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
Creates a new unhosted line load within the project using data at two points.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace